{"account": {"description": "The dataset titled \"account\" contains information related to district fees, specifically focusing on the frequency and date of these fees. It includes two entries, each detailing a unique district identified by a district ID. The first entry corresponds to district ID 18 with a frequency of \"POPLATEK MESICNE\" recorded on March 24, 1995, while the second entry pertains to district ID 1 with the same frequency noted on February 26, 1993. This data provides insights into the timing and categorization of district fees over the specified dates.", "tags": ["district_id", "frequency", "date", "monthly payments", "financial data", "Czech Republic", "1990s"], "min_year": "1993", "max_year": "1995"},
  "card": {"description": "The dataset titled \"card\" contains information about different types of cards, identified by their unique display IDs (disp_id). It includes two entries: one for a gold card issued on October 16, 1998, and another for a classic card issued on March 13, 1998. The data is structured in three columns: disp_id, type, and issued, providing a clear overview of the card types and their respective issuance dates. This dataset could be useful for analyzing trends in card issuance over time.", "tags": ["card", "disp_id", "type", "issued", "gold", "classic", "1998"], "min_year": "1998", "max_year": "1998"},
  "client": {"description": "The dataset titled \"client\" contains demographic information with three columns: gender, birth_date, and district_id. It includes two entries, one for a female born on December 13, 1970, residing in district 18, and another for a male born on February 4, 1945, residing in district 1. This data provides insights into the gender distribution and age demographics of individuals within specific districts.", "tags": ["gender", "birth_date", "district_id", "demographics", "population", "age_distribution", "data_records"], "min_year": "1945", "max_year": "1970"},
  "disp": {"description": "The dataset titled \"disp\" contains information about client and account relationships. It includes three columns: client_id, account_id, and type. The data consists of two entries, both indicating that the clients (with IDs 1 and 2) are the owners of their respective accounts (also with IDs 1 and 2). This dataset provides a straightforward overview of ownership status for the specified clients and accounts.", "tags": ["client data", "account information", "ownership type", "financial records", "customer accounts", "data entries", "business transactions"], "min_year": "nan", "max_year": "nan"},
  "district": {"description": "The dataset titled \"district\" contains information about two districts in the Czech Republic: Hl.m. Praha (Prague) and Benesov (Central Bohemia). Each row provides various attributes, including population figures, economic indicators, and demographic statistics. For instance, Hl.m. Praha has a population of 1,204,953, while Benesov has 88,884 residents. The data also includes metrics such as employment rates, average income, and other socio-economic factors, offering a comprehensive overview of these regions.", "tags": ["Czech Republic", "District Data", "Population Statistics", "Geographical Data", "Urban Areas", "Demographic Information", "Economic Indicators"], "min_year": "nan", "max_year": "nan"},
  "loan": {"description": "The dataset titled \"loan\" contains information about loan accounts, with each entry detailing specific attributes of individual loans. It includes columns for account ID, date of loan issuance, loan amount, duration in months, number of payments made, and the status of the loan. The data spans two records, with the first record dated January 5, 1994, and the second dated April 29, 1996. The amounts and durations vary, providing insights into the loan characteristics and repayment statuses.", "tags": ["loan", "financial data", "transactions", "payments", "status", "amount", "duration"], "min_year": "1994", "max_year": "1996"},
  "order": {"description": "The dataset titled \"order\" contains transaction information with five key attributes: account_id, bank_to, account_to, amount, and k_symbol. It includes two records of financial transactions, detailing the account identifiers, the destination banks, the recipient account numbers, the transaction amounts, and the associated symbols for each transaction. The first entry reflects a transfer of 2452.0 with the symbol SIPO, while the second entry shows a transfer of 3372.7 with the symbol UVER. This data is useful for analyzing banking transactions and understanding the flow of funds between accounts.", "tags": ["financial transactions", "banking", "account transfers", "money movement", "currency exchange", "transaction amounts", "k_symbol usage"], "min_year": "nan", "max_year": "nan"},
  "trans": {"description": "The dataset titled \"trans\" contains transaction records with key details about financial activities. It includes columns such as transaction ID (trans_id), account ID (account_id), transaction date (date), transaction type (type), operation type (operation), transaction amount (amount), account balance (balance), currency symbol (k_symbol), bank name (bank), and account number (account). The data features two entries from March and April 1995, detailing a deposit and a transfer from an account, along with their respective amounts and resulting balances. Notably, some fields, such as currency symbol and bank name, are marked as 'nan', indicating missing information.", "tags": ["financial transactions", "banking", "account management", "deposits", "transfers", "1995", "money movement"], "min_year": "1995", "max_year": "1995"}}