[{"sum": "The function sum aims to calculate the sum of specified columns in a DataFrame, optionally grouping the data by certain columns. It takes a filter dictionary to determine which columns to sum and how to group the data, if applicable."},
  {"mean": "The function mean calculates the average values of specified columns in a DataFrame, optionally grouping the data by one or more columns. It takes a filter dictionary to determine which columns to group by and which columns to compute the mean for."},
  {"max": "The function max aims to retrieve the maximum value from specified columns in a DataFrame, optionally returning a defined number of rows with the highest values. It can handle both single-column and multi-column scenarios, providing either the maximum value or the rows containing the maximum values based on the provided filters."},
  {"min": "The function min aims to retrieve the minimum values from specified columns in a DataFrame, returning either a single value or a specified number of rows containing the minimum values based on the provided filter criteria. It handles both single-column and multi-column scenarios, ensuring flexibility in the output format."},
  {"filter": "The function filter aims to apply specified filtering conditions to a DataFrame, allowing users to refine their data based on various criteria such as location, year range, and specific values. It processes a dictionary of conditions to return a filtered version of the DataFrame that meets the defined criteria."},
  {"sortby": "The function sortby aims to sort a given DataFrame or Series based on a specified column and order (ascending or descending) as defined in the filter_dict. It processes the filter_dict to determine the sorting criteria and applies the sorting operation accordingly."},
  {"count": "The function count aims to count the occurrences of a specified value within a designated column of a DataFrame, optionally grouping the results by another column. It processes the provided filter criteria to perform the counting operation and returns the aggregated results."},
  {"returnResult": "The function filter_dict is designed to extract and return specific columns from a dataset based on the provided criteria. Its goal is to streamline data retrieval by allowing users to specify which columns they are interested in."},
  {"retrieve": "The function filter_dict is designed to filter and retrieve specific product information based on a given product URL. Its goal is to streamline the process of accessing relevant product data from a larger dataset."},
  {"combine": "The function combine aims to merge or filter two data products based on specified columns and a matching condition, allowing for either an equal or unequal comparison. It processes the input data to create a unified dataset by either joining or filtering rows according to the criteria defined in the provided filter dictionary."}]