[{"sum": "The function `sum` calculates the sum of specified columns in a dataframe, grouped by a list of columns provided. It requires a list of columns for summation and optionally allows for grouping by additional columns."}, {"mean": "The function mean calculates the mean of specified columns in a dataframe, grouped by a list of columns provided by the user. It requires a list of columns for grouping and a list of columns for which the mean should be computed."}, {"diffrence": "The function diffrence calculates the difference between two data sources, source_A and source_B, by subtracting the values of source_B from those of source_A. Its goal is to provide insights into the variations between the specified data sources."}, {"division": "The function `division` calculates the division of multiple data sources, specifically dividing the values from `source_A` by those from `source_B`. It takes two data sources as input, where `source_A` is the numerator and `source_B` is the denominator."}, {"multiplication": "The function multiplication calculates the product of values from two data sources, source_A and source_B. It aims to provide a combined result by multiplying the data from these specified sources."}, {"sum_multiple": "The function sum_multiple calculates the summation of multiple data sources, specifically combining the values from source_A and source_B. It aims to provide a total by aggregating data from the specified sources."}, {"max": "The function max retrieves the maximum value for a specified list of columns in a dataframe, returning a single value based on the provided parameters. It allows users to specify which columns to analyze and the number of rows to consider in the calculation."}, {"min": "The function min retrieves the maximum value for a specified list of columns in a dataframe, returning a single value based on the provided filter criteria. It allows users to specify which columns to consider and the number of rows to be returned."}, {"filter": "The function `filter` aims to filter a data product row-wise based on specified conditions in the provided `filter_dict`, while retaining all input columns. It allows users to define criteria for filtering, such as location and year range, to refine the dataset according to their needs."}, {"getValues": "The function getValues retrieves specified data values in a list format from a given API endpoint. It allows users to filter results based on a specified column and value, returning all columns if the value is set to None."}, {"sortby": "The function sortby sorts the data based on specified columns in either ascending or descending order, as determined by the provided parameters. It allows users to define the column for sorting and the desired order of the results."}, {"count": "The function count is designed to count the occurrences of a specific value or values within a specified column of data. It takes parameters that define the column to search and the value to count, allowing for targeted data analysis."}, {"returnResult": "The function returnResult retrieves or extracts previously computed data from a dataframe based on the specified columns. It allows users to specify which columns they want to return or extract through a filter dictionary."}, {"retrieve": "The function `retrieve` aims to fetch a specified data product by taking the product's name and a list of requested columns as input arguments. It returns the relevant data based on the provided parameters."}, {"combine": "The function combine aims to merge two data products by performing a join operation based on specified matching columns from each product. It allows for the selection of columns to match on and supports both equal and unequal join types."}]