[{"sum": "The function `getSum` calculates the sum of specified columns in a DataFrame, optionally grouping the data by specified columns. It takes a DataFrame and a filter dictionary to determine which columns to sum and how to group the data."},
  {"mean": "The function `mean` calculates the mean of specified columns in a DataFrame, optionally grouping the data by specified columns. It takes a DataFrame and a filter dictionary as parameters to determine the grouping and the columns for which the mean should be computed."},
  {"max": "The function `getMax` retrieves the maximum values from a specified column or columns in a DataFrame, returning either a specified number of rows with the largest values or a single maximum value along with its index. It allows for flexible filtering based on the provided `filter_dict` parameters."},
  {"min": "The function `getMin` retrieves the minimum values from a specified list of columns in a DataFrame, returning either a specified number of rows with the smallest values or a single minimum value along with its index. It processes the input filter dictionary to determine the columns and number of rows to return."},
  {"filter": "The function `applyFilter` aims to filter a DataFrame based on specified conditions provided in a dictionary format. It processes various types of conditions, including ranges, lists, and specific values, to return a filtered version of the DataFrame."},
  {"sortby": "The function `sortby` is designed to sort a given DataFrame or Series based on a specified column and order (ascending or descending) as defined in the `filter_dict`. It returns the sorted DataFrame or Series, or the original input if sorting fails."},
  {"count": "The function `count` aims to count the occurrences of a specified value within a designated column of a DataFrame, optionally grouping the results by another column. It processes a filter dictionary to determine the column and value to count, and returns a DataFrame with the count results."},
  {"returnResult": "The function `returnResult` aims to filter and extract specific columns from a dataset based on the provided criteria. It allows users to specify which columns they want to retrieve, streamlining data manipulation and analysis."},
  {"retrieve": "The function `retrieve` aims to filter and return a dictionary containing product information based on a specified product URL. It processes the input to extract relevant details associated with the product."},
  {"combine": "The function `combineProducts` aims to merge two data products (dataframes or series) based on specified matching columns and a filter type (equal or unequal). It processes the input data according to the provided filter criteria, resulting in a combined dataframe that reflects the desired matches or exclusions."}]