[{"sum": "The function `sum` calculates the sum of specified columns in a DataFrame, optionally grouping the data by a list of specified columns. It takes a DataFrame and a filter dictionary that defines the grouping and the columns for which the sum should be computed."}, {"mean": "The function `mean` calculates the mean of specified columns in a DataFrame, optionally grouping the data by a list of specified columns. It takes a DataFrame and a filter dictionary as parameters, where the dictionary defines the grouping columns and the columns for which the mean should be computed."}, {"max": "The function `getMax` retrieves the maximum value from specified columns in a given dataframe, returning either a single maximum value or the top rows based on the provided filters. It allows users to specify which columns to consider and how many rows to return, facilitating data analysis."}, {"min": "The function `getMin` retrieves the minimum value for a specified list of columns in a dataframe, returning either a single value or a specified number of rows containing the minimum values. It processes the input filter dictionary to determine the columns and the number of rows to return."}, {"filter": "The function `applyFilter` filters a data product based on the specified conditions in the `filter_dict`, allowing for row-wise filtering while retaining all input columns. It processes various types of conditions, including ranges, lists, and specific values, to refine the DataFrame accordingly."}, {"sortby": "The function `sortby` sorts a given DataFrame or Series based on specified columns and the desired order (ascending or descending). It takes a DataFrame or Series and a filter dictionary as parameters to determine the sorting criteria."}, {"count": "The function `count` aims to count the occurrences of a specific value or values in a specified column of a DataFrame, optionally grouping the results by another column. It processes a filter dictionary to determine the target column and value for counting, and returns a DataFrame with the counts."}, {"returnResult": "The function `returnResult` retrieves or extracts previously computed data from a dataframe based on the specified columns provided in the `filter_dict`. Its goal is to return the relevant data as specified by the user."}, {"retrieve": "The function `retrieve` aims to fetch a specified data product by taking the product's name and a list of requested columns as input arguments. It utilizes a filter dictionary to identify the product URL for retrieval."}, {"combine": "The function `combineProducts` aims to merge two data products (dataframes or series) based on specified matching columns and conditions, allowing for both equal and unequal joins. It processes the input data according to the provided filter criteria, ensuring that the resulting dataset reflects the desired relationships between the two data products."}]