{"cards":
  {"description": "The dataset titled \"cards\",the provided data contains information about two Magic: The Gathering cards, \"Ancestor's Chosen\" and \"Angel of Mercy.\" Each card entry includes various attributes such as the artist, mana cost, card type, and special abilities. For instance, \"Ancestor's Chosen\" is a Human Cleric with a converted mana cost of 7 and the ability to gain life based on the number of cards in the graveyard, while \"Angel of Mercy\" is an Angel that allows the player to gain life upon entering the battlefield. The data also includes links for purchasing the cards from different marketplaces, rarity classifications, and additional gameplay details.", "tags": ["Magic: The Gathering", "Card Data", "Creatures", "2003", "Uncommon", "Life Gain", "First Strike"], "min_year": "2003", "max_year": "2003"},
  "foreign_data":
  {"description": "The dataset titled \"foreign_data\" contains information about a specific creature card from a trading card game, presented in two different languages: German and Spanish. Each entry includes the flavor text, language, multiverse ID, card name, abilities, type, and a unique identifier (UUID). The card, known as \"Ausgewählter der Ahnfrau\" in German and \"Elegido de la Antepasada\" in Spanish, features abilities such as first strike and life gain based on the number of cards in the graveyard. This data provides insights into the card's characteristics and its representation in different languages.", "tags": ["flavorText", "language", "multiverseid", "name", "text", "type", "uuid"], "min_year": "nan", "max_year": "nan"},
  "legalities":
  {"description": "The dataset titled \"legalities\" contains information regarding different formats and their legal statuses, identified by unique UUIDs. It includes two entries: the \"commander\" format and the \"duel\" format, both of which are marked as \"Legal.\" Each entry is associated with the same UUID, indicating that they may be part of a related legal framework or regulation. This data could be useful for understanding the legal standing of various gaming formats within a specific context.", "tags": ["legalities", "status", "uuid", "format", "data entries", "legal status", "unique identifiers"], "min_year": "nan", "max_year": "nan"},
  "rulings":
  {"description": "The dataset titled \"rulings\" contains two entries related to game mechanics and rules clarifications. Each entry includes a date, a specific text ruling, and a unique identifier (UUID). The first entry, dated July 15, 2007, explains the timing of drawing a card in relation to the resolution of a Bandage effect. The second entry, from February 1, 2007, discusses the mathematical implications of doubling a negative life total in gameplay. This data provides insights into the nuances of game rules and their interpretations.", "tags": ["rulings", "card game", "game mechanics", "life total", "game rules", "trading card game", "game strategy"], "min_year": "2007", "max_year": "2007"},
  "sets":
  {"description": "The dataset titled \"set_translations\",the provided data contains information about various card sets from a trading card game, specifically focusing on the Core Set. Each entry includes details such as the base set size, block, booster configurations, and release dates. The data also specifies whether the cards are foil, foreign, or online-only, along with unique identifiers like mcmId and tcgplayerGroupId. Additionally, the entries include the total set size and type, offering a comprehensive overview of the card sets and their characteristics.", "tags": ["Magic: The Gathering", "Card Sets", "Core Set", "Trading Card Game", "Booster Packs", "Release Dates", "Card Types"], "min_year": "1993", "max_year": "2007"},
  "set_translations":
  {"description": "The dataset titled \"set_translations\" contains translations of a specific set, identified by the set code \"10E.\" It includes two entries: one for Chinese Simplified and another for Chinese Traditional, both translating to \"核心系列第十版,\" which means \"Core Series Tenth Edition.\" This data highlights the linguistic adaptations of the set for different Chinese-speaking audiences, emphasizing its relevance and accessibility in diverse regions.", "tags": ["language", "setCode", "translation", "Chinese", "translation set", "10E", "core series"], "min_year": "nan", "max_year": "nan"}}