{"GHG_by_sector_and_country_DACH": {
  "description": "The dataset titled \"GHG_by_sector_and_country_DACH\" provides a detailed overview of carbon dioxide (CO2) emissions from the agriculture sector in Austria and Switzerland (including Liechtenstein) over a span of 54 years, from 1970 to 2023. It includes substance information, sector categorization, country identification codes, and annual emission values for both countries. Each row represents the CO2 emissions for a specific country across the years, reflecting trends and fluctuations in emissions over time. This data can be useful for analyzing the impact of agricultural practices on greenhouse gas emissions in the DACH region.",
  "tags": ["Greenhouse Gas Emissions", "Agriculture Sector", "Austria", "Switzerland", "Time Series Data", "1970-2023", "CO2 Levels"],
  "min_year": 1970,
  "max_year": 2023
},
  "GHG_by_sector_and_country_EU27": {
    "description": "The dataset \"GHG_by_sector_and_country_EU27\" contains information on carbon dioxide (CO2) emissions from the agriculture sector in Austria and Belgium, measured annually from 1970 to 2023. Each row represents a different country, detailing the annual emissions in specific sectors over more than five decades. The values show varying trends in emissions for both countries, highlighting periods of increase and decrease. This data serves as a valuable resource for analyzing agricultural carbon emissions within the EU context, reflecting the efforts and changes in environmental policy over time.",
    "tags": ["Greenhouse Gas Emissions", "Agriculture Sector", "EU27 Countries", "Time Series Data", "CO2 Emissions", "Country Comparison", "Longitudinal Study"],
    "min_year": 1970,
    "max_year": 2023
  },
  "GHG_per_capita_by_country_DACH": {
    "description": "The dataset titled \"GHG_per_capita_by_country_DACH\" contains greenhouse gas (GHG) emissions per capita for Austria and Switzerland, spanning the years from 1970 to 2023. Each row represents a country with its respective emissions values recorded annually over this extensive period. The data highlights fluctuations in GHG emissions, with Austria displaying relatively consistent values, while Switzerland's emissions reflect a general decline from the early 2000s onwards. This dataset can be instrumental for researchers and policymakers focused on analyzing environmental trends and formulating climate action strategies in the DACH region.",
    "tags": ["GHG emissions", "per capita", "Austria", "Switzerland", "time series", "1970-2023", "environmental data"],
    "min_year": 1970,
    "max_year": 2023
  }, "GHG_per_capita_by_country_EU27": {
  "description": "The dataset titled \"GHG_per_capita_by_country_EU27\" contains greenhouse gas emissions data per capita for Austria and Belgium from the years 1970 to 2023. The first entry includes the country code and the name, followed by a series of annual emissions figures for each country. Austria's emissions show a general trend of fluctuations with a peak around 2011, while Belgium demonstrates a decline in emissions over the years following a peak in the late 1980s. This dataset highlights the variations in greenhouse gas emissions across these two European countries over more than five decades.",
  "tags": ["GHG emissions", "EU27 countries", "environmental data", "time series", "per capita values", "Austria and Belgium", "historical records"],
  "min_year": 1970,
  "max_year": 2023
}, "GHG_per_GDP_by_country_DACH": {
  "description": "The dataset titled \"GHG_per_GDP_by_country_DACH\" contains greenhouse gas emissions per unit of GDP for Austria and Switzerland (including Liechtenstein) from the years 1990 to 2023. It features two countries, each represented by their respective country code and GHG emissions data over the specified timeline. The emission values demonstrate fluctuations in emissions with Austria generally showing higher values compared to Switzerland. This data is significant for analyzing trends in greenhouse gas emissions relative to economic growth in the DACH region over a 33-year period.",
  "tags": ["GHG emissions", "GDP", "Austria", "Switzerland", "1990-2023", "economic data", "environmental statistics"],
  "min_year": "1990",
  "max_year": "2023"
}, "GHG_per_GDP_by_country_EU27": {
  "description": "The dataset titled \"GHG_per_GDP_by_country_EU27\" provides greenhouse gas emissions per GDP for two European countries, Austria and Belgium, spanning from 1990 to 2023. It includes annual values indicating emissions levels in both countries, showing trends over the years. Austria's emissions are characterized by a general decline, particularly notable from 2004 onwards, while Belgium exhibits a similar downward trend with fluctuations throughout the years. This data enables analysis of environmental performance relative to economic output within these nations over more than three decades.",
  "tags": ["GHG emissions", "GDP", "EU27 countries", "Environmental data", "Time series", "Economic indicators", "1990-2023"],
  "min_year": 1990,
  "max_year": 2023
}, "GHG_totals_by_country_DACH": {
  "description": "The dataset titled \"GHG_totals_by_country_DACH\" presents comprehensive greenhouse gas (GHG) emission data for two countries: Austria and Switzerland (including Liechtenstein) from 1970 to 2023. It includes a total of 55 years of data, tracking the annual emissions represented in a numerical format that reflects the varying environmental conditions and policy impacts across the decades. Each country is represented with its respective GHG totals for each year, showcasing trends and shifts in emission levels over time. This data can be useful for analyzing the effectiveness of environmental regulations and understanding the climate impact of these countries within the DACH region.",
  "tags": ["GHG emissions", "Country data", "DACH region", "Longitudinal study", "Annual data", "Environmental data", "Time series analysis"],
  "min_year": 1970,
  "max_year": 2023
}, "GHG_totals_by_country_EU27": {
  "description": "The dataset titled \"GHG_totals_by_country_EU27\" presents greenhouse gas emissions data for two EU countries, Austria and Belgium, spanning from 1970 to 2023. Each row contains emissions values measured in metric tons, demonstrating fluctuations over the decades across multiple years. For Austria, emissions show an overall trend of increase with notable peaks and troughs, while Belgium experiences a decrease in emissions towards the end of the timeline. This data is crucial for analyzing the environmental policy impacts and progress toward emission reduction targets within the EU.",
  "tags": ["GHG Emissions", "EU27 Countries", "Time Series Data", "Environmental Statistics", "Annual Data", "Carbon Footprint", "Climate Change"],
  "min_year": 1970,
  "max_year": 2023}
}