{"GHG_per_GDP_by_country": {"description": "The dataset titled \"GHG_totals_by_country\" provides a comprehensive overview of greenhouse gas emissions measured in various countries, alongside aggregated numbers for international aviation and shipping. Each row presents data corresponding to specific nations, detailing their respective GHG emissions figures. The data fields include a wide array of countries, ranging from Aruba and Afghanistan to global totals, indicating substantial insights into emissions trends across different regions. This information is critical for understanding the environmental impact of different nations and for assessing global efforts to mitigate climate change.", "tags": ["GHG emissions by country", "International Aviation and Shipping", "Environmental Data", "CO2 and greenhouse gases", "Global context", "Yearly statistics", "Country-specific data"], "min_year": "1970", "max_year": "2023"},
  "GHG_per_capita_by_country": {"description": "The provided dataset, titled \"GHG_per_capita_by_country,\" presents greenhouse gas emissions per capita for a comprehensive list of countries and territories. The data includes values for a wide range of nations, from Aruba to Zimbabwe, along with a global total and a figure for the EU27. Each entry quantifies emissions in terms of tons per capita, allowing for comparative analysis of countries' environmental impact. The dataset is crucial for understanding the contribution of individual countries to global greenhouse gas emissions and can serve as a basis for further environmental research and policy-making.", "tags": ["Greenhouse Gas Emissions", "Per Capita", "Country Data", "Environmental Statistics", "Global Data", "Yearly Comparison", "Climate Impact"], "min_year": "1970", "max_year": "2023"},
  "GHG_totals_by_country": {"description": "The dataset titled \"GHG_by_sector_and_country_CO2_Agriculture\" contains information on carbon dioxide (CO2) emissions from agriculture across various countries. The data columns represent a wide range of countries and regions, including Afghanistan, Argentina, the United States, and the EU27, among others. Each country has a corresponding value indicative of CO2 emissions, measured in a specific manner that appears to include several numerical entries along with instances of 'nan' indicating missing data. This dataset offers insights into agricultural emissions and can be essential for understanding global and regional contributions to greenhouse gas emissions.", "tags": ["GHG emissions", "CO2 emissions", "Agriculture sector", "International data", "Multiple countries", "Time series", "Climate change"], "min_year": "1970", "max_year": "2023"},
  "GHG_by_sector_and_country_CO2_Agriculture": {"description": "The dataset titled \"GHG_by_sector_and_country_CO2_Buildings\" contains greenhouse gas (GHG) emissions data categorized by various countries and regions, specifically focusing on CO2 emissions from the buildings sector. The data includes values for a wide range of countries, listed alphabetically from Aruba to Zimbabwe, along with a global total and the aggregate for the EU27. Each country entry includes emissions figures, represented in a comma-separated format, denoting the amount of CO2 emissions attributed to building-related activities. Notably, there are instances of 'nan' indicating missing or unreported data for specific countries. This dataset can be useful for analyzing trends in building-related carbon emissions on a global scale.", "tags": ["GHG emissions", "international data", "country comparisons", "CO2 by sector", "time series", "environmental statistics", "buildings sector"], "min_year": "1970", "max_year": "2023"},
"GHG_by_sector_and_country_CO2_Buildings": {"description": "The dataset titled \"GHG_by_sector_and_country_CO2_Buildings\" provides a comprehensive overview of greenhouse gas (GHG) emissions specifically from the building sector across various countries. The first row contains country names, including prominent nations such as the United States, China, and Australia, along with smaller entities like Aruba and Anguilla. The corresponding values indicate the amount of CO2 emissions attributed to buildings in each country, presented in a comma-separated format. The data reveals significant variations in CO2 emissions, reflecting each country's unique energy consumption patterns, urbanization levels, and policy measures related to building efficiency.", "tags": ["CO2 Emissions", "Buildings Sector", "Global Data", "Country-Specific Data", "Time Series", "Environmental Data", "International Comparisons"], "min_year": "1970", "max_year": "2023"}}