{"GHG_by_sector_and_country": {
  "description": "The dataset titled \"GHG_by_sector_and_country\" provides greenhouse gas (GHG) emissions data categorized by sector and country from 1970 to 2023. It includes two entries for the agriculture sector in Afghanistan and Albania, detailing their respective emissions values over the years. The data reveals trends in emissions, with Afghanistan showing fluctuations and a notable increase in recent years, while Albania's emissions demonstrate a more stable pattern with some variations. This dataset is valuable for analyzing the impact of agricultural practices on GHG emissions across different countries over time.",
  "tags": ["GHG emissions", "Agriculture sector", "Country data", "Time series", "Environmental statistics", "Global data", "Country comparison"],
  "min_year": "1970",
  "max_year": "2023"},
  "GHG_per_capita_by_country": {
    "description": "The dataset titled \"GHG_per_capita_by_country\" provides greenhouse gas emissions per capita for various countries from 1970 to 2023. It includes data for Aruba and Afghanistan, showcasing their annual emissions in metric tons per person over the specified years. The emissions for Aruba demonstrate a general upward trend, particularly notable in the late 1980s and early 2000s, while Afghanistan's emissions show fluctuations with a significant decline in the late 1990s and early 2000s. This dataset is valuable for analyzing trends in greenhouse gas emissions and understanding the environmental impact of different countries over time.",
    "tags": ["GHG emissions", "per capita", "country data", "environmental statistics", "time series", "1970s to 2020s", "global warming"],
    "min_year": "1970",
    "max_year": "2023"},
  "GHG_per_GDP_by_country": {
    "description": "The dataset titled \"GHG_per_GDP_by_country\" provides greenhouse gas emissions per unit of GDP for two countries, Aruba and Afghanistan, spanning from 1990 to 2023. Each row contains the annual emissions data, measured in a specific unit, reflecting the economic performance and environmental impact of these nations over the years. The data reveals fluctuations in emissions, with Aruba showing a general trend of increase and decrease, while Afghanistan exhibits a more volatile pattern with significant peaks and troughs. This dataset is valuable for analyzing the relationship between economic growth and greenhouse gas emissions in these countries over the specified timeline.",
    "tags": ["GHG emissions", "GDP", "Country data", "Time series", "Environmental statistics", "Economic indicators", "Longitudinal study"],
    "min_year": "1990",
    "max_year": "2023"},
  "GHG_totals_by_country": {
    "description": "The dataset titled \"GHG_totals_by_country\" provides greenhouse gas (GHG) emissions data for various countries from 1970 to 2023. Each row represents a different country, with the first column indicating the country name and subsequent columns displaying the GHG emissions values for each year. For instance, Aruba's emissions show a gradual increase from 0.037 in 1970 to a peak of 0.589 in 2022, while Afghanistan's emissions exhibit more fluctuation, starting at 15.437 in 1970 and reaching 29.46 by 2023. This data can be useful for analyzing trends in GHG emissions over time and comparing the performance of different countries in terms of emissions reduction or increase.",
    "tags": ["GHG emissions", "country data", "time series", "environmental statistics", "1970s to 2023", "global warming", "climate change"],
    "min_year": "1970",
    "max_year": "2023"},
  "LULUCF_macroregions": {
    "description": "The dataset titled \"LULUCF_macroregions\" provides a comprehensive overview of land use, land-use change, and forestry (LULUCF) metrics across Africa from 1990 to 2023. It includes two main sectors: Deforestation and Fires, with annual values reflecting the extent of deforestation and the occurrence of fires over the years. The data reveals trends in deforestation, showing a gradual increase in values, while the fire sector exhibits more variability, with notable peaks and troughs throughout the years. This dataset is essential for understanding environmental changes and challenges in Africa related to land use and forestry practices.",
    "tags": ["Africa", "Deforestation", "Fires", "Environmental Data", "Climate Change", "1990-2023", "Sector Analysis"],
    "min_year": "1990",
    "max_year": "2023"}}