{"frpm":
{"description": "The dataset titled \"frpm\" contains information from the 2014-2015 academic year, focusing on schools within Alameda County, California. It includes data for two schools: FAME Public Charter and Envision Academy for Arts & Technology, both categorized under the County Office of Education. Key metrics provided include enrollment figures, free meal counts, and percentages of students eligible for free meals and free/reduced-price meals (FRPM) for both K-12 and ages 5-17. The dataset highlights the socioeconomic status of the student population and the schools' participation in federal meal programs.", "tags": ["Education", "California", "K-12 Schools", "Public Schools", "Charter Schools", "Free Meal Program", "Enrollment Data"], "min_year": "2014", "max_year": "2015"},
  "satscores": {"description": "The dataset titled \"satscores\" contains information related to SAT scores and enrollment statistics for educational institutions in Alameda County. It includes two records: one for a district (D) and another for a school (S). Key metrics provided are the number of students enrolled, the number of test takers, and average scores in reading, math, and writing, along with the number of students scoring 1500 or above. The data highlights the performance of FAME Public Charter School and the overall district, allowing for comparisons in academic achievement.", "tags": ["education", "California", "Alameda County", "student performance", "standardized testing", "enrollment data", "average scores"], "min_year": "nan", "max_year": "nan"},
  "schools": {"description": "The dataset titled \"schools\",the  provided dataset contains information about educational institutions in Alameda County, California. It includes details such as the CDS code, NCES district and school identifiers, status type (active or closed), and various contact information including addresses, phone numbers, and websites. Additionally, the dataset specifies the type of funding, operational characteristics, and administrative contacts for each school. The data reflects both active and closed schools, with the last update noted for each entry, offering a comprehensive overview of the educational landscape in the region.", "tags": ["Education", "California", "School Districts", "Charter Schools", "Active Status", "Closed Status", "K-12"], "min_year": "2005", "max_year": "2015"}}